Repository: VasyliskG/ChatProto
Catalog: ChatProto/Strings/*/Resources.resw
Source language: en_us
Languages: uk_ua

# TitleText.Text
source: Settings
uk_ua: Налаштування

# ThemeLabel.Text
source: Theme
uk_ua: Тема

# LanguageLabel.Text
source: Language
uk_ua: Мова

# ThemeLightRadio.Content
source: Light
uk_ua: Світла

# ThemeDarkRadio.Content
source: Dark(Dont work)
uk_ua: Темна(Не працює)

# LanguageUkrainianRadio.Content
source: Ukrainian
uk_ua: Українська

# LanguageEnglishRadio.Content
source: English
uk_ua: Англійська

# MessageInput.PlaceholderText
source: Type a message...
uk_ua: Введіть повідомлення...

# ChatHistoryTitle.Text
source: Chat History
uk_ua: Історія чатів

# ChatHistoryDescription.Text
source: Your saved chats will appear here. Log in to save them.
uk_ua: Тут показуватимутся ваші збережені чати. Увійдіть щоб зберегти їх.

# WelcomeMessage
source: Hello, can I help you?
uk_ua: Привіт, чим я можу тобі допомогти?

# LoginPage_UsernameTextBox.PlaceholderText
source: Enter your email
uk_ua: Введіть свою електронну пошту

# LoginPage_UsernameErrorTextBlock.Text
source: Username cannot be empty
uk_ua: Логін не може бути порожнім

# LoginPage_InputPasswordBox.PlaceholderText
source: Enter your password
uk_ua: Введіть пароль

# LoginPage_InputPasswordErrorTextBlock.Text
source: Password cannot be empty
uk_ua: Пароль не може бути порожнім

# LoginPage_LoginErrorTextBlock.Text
source: Invalid username or password
uk_ua: Невірний логін або пароль

# LoginPage_LoginButton.Content
source: Log in
uk_ua: Ввійти

# LoginPage_RegisterLink.Content
source: Register
uk_ua: Реєстрація

# RegisterPage_TitleText.Text
source: Register
uk_ua: Реєстрація

# RegisterPage_UsernameTextBox.PlaceholderText
source: Enter your username
uk_ua: Введіть своє ім'я користувача

# RegisterPage_EmailTextBox.PlaceholderText
source: Enter your email
uk_ua: Введіть свою електронну пошту

# RegisterPage_FullNameTextBox.PlaceholderText
source: Enter your full name
uk_ua: Введіть своє ім'я

# RegisterPage_InputPasswordBox.PlaceholderText
source: Enter your password
uk_ua: Введіть пароль

# RegisterPage_UsernameErrorTextBlock
source: Username cannot be empty
uk_ua: Ім'я користувача не може бути порожнім

# RegisterPage_FullNameErrorTextBlock
source: Full name cannot be empty
uk_ua: Повне ім'я не може бути порожнім

# RegisterPage_RegisterErrorTextBlock
source: Registration failed. Please try again.
uk_ua: Реєстрація не вдалася. Будь ласка, спробуйте ще раз.

# RegisterPage_RegisterButton.Content
source: Register
uk_ua: Зареєструватися

# RegisterPage_LoginLink.Content
source: Already have an account? Log in
uk_ua: У вас вже є аккаунт? Ввійти

# RegisterPage_ConfirmPasswordErrorTextBlock.Text
source: Confirm your password
uk_ua: Підтвердьте свій пароль

# LoginPage_Title.Text
source: Log in
uk_ua: Вхід

# UsernameEmptyError
source: Username cannot be empty
uk_ua: Логін не може бути порожнім

# UsernameLengthError
source: Username must be at least 3 characters long
uk_ua: Логін повинен містити не менше 3 символів

# EmailEmptyError
source: Email cannot be empty
uk_ua: Email не може бути порожнім

# EmailInvalidError
source: Please enter a valid email
uk_ua: Введіть коректний email

# FullNameEmptyError
source: Full name cannot be empty
uk_ua: Повне ім'я не може бути порожнім

# PasswordEmptyError
source: Password cannot be empty
uk_ua: Пароль не може бути порожнім

# PasswordLengthError
source: Password must be at least 6 characters long
uk_ua: Пароль повинен містити не менше 6 символів

# PasswordsMismatchError
source: Passwords do not match
uk_ua: Паролі не співпадають

# RegisterError
source: Registration failed. Please try again.
uk_ua: Реєстрація не вдалася. Спробуйте ще раз.

# RegisterPage_ConfirmPasswordBox.PlaceholderText
source: Confirm your password
uk_ua: Підтвердьте свій пароль
